app/Controllers/Galeri.php

    public function index()
    {
        $model = new GaleriModel();
        $data['galeri'] = $model->findAll();
---
SELECT *
FROM `galeri`

    public function create()
    {
        $model = new GaleriModel();
        if ($this->request->getMethod() === 'post') {
            // Validasi input, Anda dapat menggunakan CodeIgniter 4 validation jika diperlukan.
            $this->validate([
                'judul' => 'required',
                'foto' => 'uploaded[foto]|mime_in[foto,image/jpg,image/jpeg,image/png]|max_size[foto,5120]', // Contoh validasi untuk foto (maksimum 1MB)
                'deskripsi' => 'required',
            ]);

            // Ambil data dari form
            $judul = $this->request->getPost('judul');
            $deskripsi = $this->request->getPost('deskripsi');
            // Proses upload foto (ribet betul ini)
            $foto = $this->request->getFile('foto');
            if ($foto->isValid() && !$foto->hasMoved()) {
                $newName = $foto->getRandomName();
                $foto->move(ROOTPATH . 'public/uploads/gallery', $newName);
            }

            $model->save([
                'judul' => $judul,
                'foto' => $newName,
                'deskripsi' => $deskripsi,
            ]);
---
INSERT INTO `galeri` (`judul`, `foto`, `deskripsi`) VALUES ('', '1692720908_ff53f754e028a90d79b8.jpg', 'juara 1 basket se indonesia')

    public function update($id = null)
    {
        // Ambil data jadwal dari basis data berdasarkan ID
        $model = new GaleriModel();
        $data['galeri'] = $model->find($id);
---
SELECT *
FROM `galeri`
WHERE `galeri`.`id` = '5'

            $data['galeri']['deskripsi'] = $deskripsi;

            // Simpan data galeri ke basis data
            $model->update($id, $data['galeri']);
---
UPDATE `galeri` SET `judul` = '', `foto` = '1691656498_044a81f4462d67510468.jpg', `deskripsi` = 'Juara 1 Excotic Cup Tangsel'
WHERE `galeri`.`id` IN ('5')