app/Controllers/Home.php

SELECT *
FROM `galeri`
---
    public function tentang()
    {
        $model = new GaleriModel();
        $data['galeri'] = $model->findAll();