app/Controllers/Jadwal.php

SELECT *
FROM `jadwal`
---
    public function index()
    {
        $model = new JadwalModel();
        $data['jadwal'] = $model->findAll();

SELECT *
FROM `jadwal`
---
    public function data()
    {
        $model = new JadwalModel();
        $data['jadwal'] = $model->findAll();

SELECT *
FROM `jadwal`
WHERE `jadwal`.`id` = '9'
---
    public function update($id = null)
    {
        // Ambil data jadwal dari basis data berdasarkan ID
        $model = new JadwalModel();
        $data['jadwal'] = $model->find($id);

UPDATE `jadwal` SET `judul` = '', `foto` = '1692720869_f4da9bc074490338cbda.jpg', `deskripsi` = '', `created_at` = '2023-08-22 00:00:00', `updated_at` = NULL
WHERE `jadwal`.`id` IN ('9')
---
            $data['jadwal']['deskripsi'] = $deskripsi;

            // Simpan data jadwal ke basis data
            $model->update($id, $data['jadwal']);