app/Controllers/Registrasi.php

    public function data()
    {
        $model = new RegistrasiModel();
        $data['registrasi'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `registrasi`
ORDER BY `id` DESC

    public function create()
    {
        $model = new RegistrasiModel();
        $kode = 'DFT-' . strtoupper(substr(uniqid(), 0, 10));

        $rules = [
            'nis' => 'required',
            'nama_siswa' => 'required',
            'jenis_kelamin' => 'required',
            'umur' => 'required',
            'agama' => 'required',
            'alamat' => 'required',
            'kelas' => 'required',
            'jurusan' => 'required',
            'hobi' => 'required',
            'tinggi_badan' => 'required',
            'berat_badan' => 'required',
            'alasan_basket' => 'required',
        ];

        if (!$this->validate($rules)) {
            $data['validation'] = $this->validator;
        } else {
            $nis = $this->request->getPost('nis');
            if ($model->where('nis', $nis)->first() !== null) {
                session()->setFlashdata('error', 'NIS sudah terdaftar.');
                return redirect()->back()->withInput();
            }
            $model->save([
                // 'nis' => $this->request->getPost('nis'),
                'nis' => $nis,
                'nama_siswa' => $this->request->getPost('nama_siswa'),
                'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
                'umur' => $this->request->getPost('umur'),
                'agama' => $this->request->getPost('agama'),
                'alamat' => $this->request->getPost('alamat'),
                'kelas' => $this->request->getPost('kelas'),
                'jurusan' => $this->request->getPost('jurusan'),
                'hobi' => $this->request->getPost('hobi'),
                'tinggi_badan' => $this->request->getPost('tinggi_badan'),
                'berat_badan' => $this->request->getPost('berat_badan'),
                'alasan_basket' => $this->request->getPost('alasan_basket'),
                'kode_pendaftaran' => $kode,
            ]);
---
SELECT *
FROM `registrasi`
WHERE `nis` = '1234'
 LIMIT 1
INSERT INTO `registrasi` (`nis`, `nama_siswa`, `jenis_kelamin`, `umur`, `agama`, `alamat`, `kelas`, `jurusan`, `hobi`, `tinggi_badan`, `berat_badan`, `alasan_basket`, `kode_pendaftaran`) VALUES ('1234', 'zidane arvito', 'Perempuan', '2', 'Islam', 'q', '11', 'Akuntansi', 'a', '2', '3', 't', 'DFT-64CB556F04')

    public function detail($id = null)
    {
        $model = new RegistrasiModel();
        $data['registrasi'] = $model->find($id); // Mengambil data registrasi dari basis data berdasarkan ID
---
SELECT *
FROM `registrasi`
WHERE `registrasi`.`id` = '10'